///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МенеджерЗаписи = РегистрыСведений.НастройкиОбменаДаннымиXDTO.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Запись.ИсходныйКлючЗаписи);
	МенеджерЗаписи.Прочитать();
	
	НастройкиПоддерживаемыеОбъекты = РегистрыСведений.НастройкиОбменаДаннымиXDTO.ЗначениеНастройки(
		МенеджерЗаписи.УзелИнформационнойБазы, "ПоддерживаемыеОбъекты");
		
	Если Не НастройкиПоддерживаемыеОбъекты = Неопределено Тогда
		ПоддерживаемыеОбъекты.Загрузить(НастройкиПоддерживаемыеОбъекты);
	КонецЕсли;
	
	НастройкиКорреспондентаПоддерживаемыеОбъекты = РегистрыСведений.НастройкиОбменаДаннымиXDTO.ЗначениеНастройкиКорреспондента(
		МенеджерЗаписи.УзелИнформационнойБазы, "ПоддерживаемыеОбъекты");
	
	Если Не НастройкиКорреспондентаПоддерживаемыеОбъекты = Неопределено Тогда
		ПоддерживаемыеОбъектыКорреспондента.Загрузить(НастройкиКорреспондентаПоддерживаемыеОбъекты);
	КонецЕсли;
	
	ТипыПлановОбменаXDTO = Новый Массив;
	
	Для Каждого ИмяПланаОбмена Из ОбменДаннымиПовтИсп.ПланыОбменаБСП() Цикл
		Если ОбменДаннымиСервер.ЭтоПланОбменаXDTO(ПланыОбмена[ИмяПланаОбмена].ЭтотУзел()) Тогда
			ТипыПлановОбменаXDTO.Добавить(Тип("ПланОбменаСсылка." + ИмяПланаОбмена));	
		КонецЕсли;
	КонецЦикла;
	
	Если ТипыПлановОбменаXDTO.Количество() Тогда
		Элементы.УзелИнформационнойБазы.ОграничениеТипа = Новый ОписаниеТипов(ТипыПлановОбменаXDTO);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

